[M_FloodingHyperionCity MissionDefinition]
MissionDescription="Moxxi used to run a deadly tournament known as the Underdome. As revenge for her infidelities, Jack burned it to the ground. She has recently discovered that Jack plans to build his own Underdome in [place]Opportunity[-place], as a further insult to her -- an insult she won't stand for. She has asked you to get to [place]Opportunity[-place] and ensure that the Underdome will never be built."

[M_FloodingHyperionCity:KillTheForeman MissionObjectiveDefinition]
ProgressMessage="Kill foreman"
